#########
# While #
#########
################################
# Завдання 1. Список квадратів #
################################
def squares(N):
    i = 0
    while i <= N:
        print(i**2)
        i+=1

###################################
# Завдання 2. Мінімальний дільник #
###################################
def minimum_divide(num):
    i = 2
    while num % i != 0: i+=1
    print(i)

######################################
# Завдання 3. Список ступенів двійки #
######################################
def list_squares(N):
    i = 1
    while i < N:
        print(i)
        i*=2

#####################################
# Завдання 4. Точний ступінь двійки #
#####################################
def exact_pow_two(N):
    i = 1
    while i < N: i *= 2
    if i == N: print("YES")
    else: print("NO")

##################################
# Завдання 5. Двійковий логарифм #
##################################
def logarithm(N): 
    val = 0
    while 2 ** val < N: val += 1
    print(val)

################################
# Завдання 6. Ранкова пробіжка #
################################
def morning_running(x, y):
    days = 1
    while x < y:
        x += (x / 100 * 10)
        days += 1
    print(days)
    
################################
# Завдання 7. Ранкова пробіжка #
################################
def bank(x, p, y):
    years = 0
    while x <= y:
        x += (x / 100 * p)
        years += 1
    print(years)
        
###############################
# Завдання 8. Числа Фібоначчі #
###############################
def Fibonachi(n):
    x = 1; y = 1
    i = 0
    while i < (n - 2):
        sum = x + y
        x = y; y = sum
        i += 1
    print(sum)

#####################################
# Завдання 9. Номер числа Фібоначчі #
#####################################
#-

#######################################
# Завдання 10. Виконавець Роздвічувач #
#######################################
def divider(A, B):
    while A != B:
        if (A / 2 >= B) and (A % 2) == 0:
            A /= 2
            print(':2')
        else:
            A -= 1
            print('-1')
            
###################################
# Завдання 11. Виконавець Водолій #
###################################
#-
            
        
        
        



if __name__ == "__main__": 
    print("Use main.py, bla-bla-bla")