#########
# While #
#########
################################
# Завдання 1. Список квадратів #
################################
def squares(N):
    i = 0
    while i <= N:
        print(i**2)
        i+=1

###################################
# Завдання 2. Мінімальний дільник #
###################################
def minimum_divide(num):
    i = 2
    while num % i != 0: i+=1
    print(i)

######################################
# Завдання 3. Список ступенів двійки #
######################################
def list_squares(N):
    i = 1
    while i < N:
        print(i)
        i*=2

#####################################
# Завдання 4. Точний ступінь двійки #
#####################################
def exact_pow_two(N):
    i = 1
    while i < N: i *= 2
    if i == N: print("YES")
    else: print("NO")

##################################
# Завдання 5. Двійковий логарифм #
##################################
# def logarithm(N):




if __name__ == "__main__": 
    print("Use main.py, bla-bla-bla")